TestCase/complex_boundary/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2312                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    (0.000848 -0.000334 -0.000240)
    (0.000848 -0.000334 -0.000240)
    (0.000848 -0.000335 -0.000242)
    (0.000849 -0.000335 -0.000242)
    (0.000847 -0.000333 -0.000240)
    (0.000848 -0.000335 -0.000243)
    (0.000849 -0.000335 -0.000241)
    (0.000848 -0.000333 -0.000240)
    (0.000850 -0.000336 -0.000242)
    (0.000849 -0.000335 -0.000241)
    (0.000847 -0.000333 -0.000240)
    (0.000849 -0.000335 -0.000240)
    (0.000847 -0.000333 -0.000240)
    (0.000850 -0.000336 -0.000240)
    (0.000850 -0.000336 -0.000242)
    (0.000849 -0.000335 -0.000241)
    (0.000848 -0.000333 -0.000240)
    (0.000849 -0.000335 -0.000240)
    (0.000847 -0.000334 -0.000242)
    (0.000848 -0.000334 -0.000243)
    (0.000848 -0.000335 -0.000243)
    (0.000849 -0.000335 -0.000241)
    (0.000848 -0.000334 -0.000241)
    (0.000850 -0.000336 -0.000241)
    (0.000849 -0.000335 -0.000241)
    (0.000849 -0.000335 -0.000241)
    (0.000849 -0.000335 -0.000240)
    (0.000846 -0.000333 -0.000242)
    (0.000850 -0.000336 -0.000242)
    (0.000845 -0.000332 -0.000241)
    (0.000846 -0.000333 -0.000242)
    (0.000848 -0.000334 -0.000243)
    (0.000847 -0.000334 -0.000243)
    (0.000847 -0.000334 -0.000242)
    (0.000847 -0.000333 -0.000239)
    (0.000848 -0.000334 -0.000242)
    (0.000847 -0.000333 -0.000241)
    (0.000849 -0.000335 -0.000242)
    (0.000847 -0.000333 -0.000241)
    (0.000848 -0.000333 -0.000239)
    (0.000847 -0.000333 -0.000241)
    (0.000849 -0.000335 -0.000239)
    (0.000849 -0.000335 -0.000240)
    (0.000847 -0.000333 -0.000241)
    (0.000847 -0.000333 -0.000240)
    (0.000851 -0.000337 -0.000241)
    (0.000847 -0.000334 -0.000243)
    (0.000848 -0.000334 -0.000241)
    (0.000849 -0.000335 -0.000240)
    (0.000848 -0.000334 -0.000241)
    (0.000848 -0.000334 -0.000242)
    (0.000848 -0.000334 -0.000240)
    (0.000847 -0.000333 -0.000240)
    (0.000847 -0.000333 -0.000241)
    (0.000849 -0.000335 -0.000240)
    (0.000846 -0.000332 -0.000241)
    (0.000848 -0.000334 -0.000240)
    (0.000848 -0.000334 -0.000241)
    (0.000849 -0.000335 -0.000241)
    (0.000848 -0.000334 -0.000240)
    (0.000850 -0.000336 -0.000242)
    (0.000848 -0.000334 -0.000240)
    (0.000850 -0.000335 -0.000240)
    (0.000847 -0.000333 -0.000242)
    (0.000849 -0.000335 -0.000241)
    (0.000847 -0.000333 -0.000242)
    (0.000847 -0.000333 -0.000239)
    (0.000850 -0.000336 -0.000241)
    (0.000847 -0.000333 -0.000242)
    (0.000848 -0.000334 -0.000242)
    (0.000848 -0.000334 -0.000239)
    (0.000848 -0.000334 -0.000241)
    (0.000850 -0.000336 -0.000241)
    (0.000849 -0.000335 -0.000241)
    (0.000848 -0.000334 -0.000241)
    (0.000846 -0.000332 -0.000240)
    (0.000848 -0.000334 -0.000239)
    (0.000846 -0.000333 -0.000242)
    (0.000847 -0.000334 -0.000242)
    (0.000847 -0.000333 -0.000242)
    (0.000847 -0.000333 -0.000241)
    (0.000848 -0.000334 -0.000239)
    (0.000849 -0.000335 -0.000240)
    (0.000847 -0.000334 -0.000243)
    (0.000850 -0.000335 -0.000240)
    (0.000846 -0.000332 -0.000242)
    (0.000845 -0.000332 -0.000241)
    (0.000848 -0.000334 -0.000241)
    (0.000849 -0.000335 -0.000241)
    (0.000845 -0.000331 -0.000241)
    (0.000848 -0.000334 -0.000239)
    (0.000851 -0.000337 -0.000241)
    (0.000846 -0.000333 -0.000242)
    (0.000847 -0.000333 -0.000241)
    (0.000848 -0.000335 -0.000242)
    (0.000848 -0.000334 -0.000239)
    (0.000850 -0.000336 -0.000241)
    (0.000850 -0.000335 -0.000240)
    (0.000847 -0.000333 -0.000243)
...
)
