TestCase/complex_boundary/constant/kinematicCloudPositions_scaled
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2312                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
    (0.000852 -0.000336 -0.000241)
...
)
