TestCase/complex_boundary/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall1
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    wall2
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    inlet1
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    outlet1
    {
        type            fixedValue;
        value           uniform 0;
    }

    defaultBoundary
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

}


// ************************************************************************* //
